{"words":[{"fixWord":false,"orientation":"across","clue":"Teknologi yang digunakan untuk membuat tampilan web yang responsif (4 huruf)","answer":"css"},{"fixWord":false,"orientation":"across","clue":"Protokol yang aman untuk mengakses halaman web (4 huruf)","answer":"HTTPS"},{"fixWord":false,"orientation":"across","clue":"Sistem manajemen basis data yang bersifat open-source (5 huruf)","answer":"MySQL"},{"fixWord":false,"orientation":"across","clue":"Bahasa pemrograman yang digunakan untuk scripting di sisi klien (10 huruf)","answer":"JavaScript"},{"fixWord":false,"orientation":"across","clue":"Alat yang digunakan untuk menguji dan mem-debug aplikasi web (7 huruf)","answer":"browser"},{"fixWord":false,"orientation":"across","clue":"Sistem yang digunakan untuk mengelola dan menyimpan data dalam aplikasi web (8 huruf)","answer":"Database"},{"fixWord":false,"orientation":"across","clue":"Teknologi yang memungkinkan pengembangan aplikasi web dengan arsitektur berbasis komponen (5 huruf)","answer":"react"}],"overallFeedback":[{"from":0,"to":100}],"theme":{"backgroundColor":"#173354","gridColor":"#000000","cellBackgroundColor":"#a5f4d0","cellColor":"#000000","clueIdColor":"#d97ab9","cellBackgroundColorHighlight":"#eeaaea","cellColorHighlight":"#f8eeac","clueIdColorHighlight":"#a0d0e9","backgroundImage":{"path":"images/file-QQK6Mx7u2vGVSfk8.jpg","mime":"image/jpeg","copyright":{"license":"U"},"width":52,"height":52}},"behaviour":{"enableInstantFeedback":false,"scoreWords":true,"applyPenalties":false,"enableRetry":true,"enableSolutionsButton":true,"keepCorrectAnswers":false},"l10n":{"across":"Across","down":"Down","checkAnswer":"Check","submitAnswer":"Submit","tryAgain":"Retry","showSolution":"Show solution","couldNotGenerateCrossword":"Could not generate a crossword with the given words. Please try again with fewer words or words that have more characters in common.","couldNotGenerateCrosswordTooFewWords":"Could not generate a crossword. You need at least two words.","probematicWords":"Some words could not be placed. If you are using fixed words, please make sure that their position doesn't prevent other words from being placed. Words with the same alignment may not be placed touching each other. Problematic word(s): @words","extraClue":"Extra clue","closeWindow":"Close window"},"a11y":{"crosswordGrid":"Crossword grid. Use arrow keys to navigate and the keyboard to enter characters. Alternatively, use Tab to navigate to type the answers in Fill in the Blanks style fields instead of the grid.","column":"Column","row":"Row","across":"Across","down":"Down","empty":"Empty","resultFor":"Result for: @clue","correct":"Correct","wrong":"Wrong","point":"point","solutionFor":"For @clue the solution is: @solution","extraClueFor":"Open extra clue for @clue","letterSevenOfNine":"Letter @position of @length","lettersWord":"@length letter word","check":"Check the characters. The responses will be marked as correct, incorrect, or unanswered.","showSolution":"Show the solution. The crossword will be filled with its correct solution.","retry":"Retry the task. Reset all responses and start the task over again.","yourResult":"You got @score out of @total points"},"taskDescription":"<p>Selamat datang di permainan Teka-Teki Silang (TTS) bertema Pengembangan Aplikasi Web!<br />Dalam permainan ini, Anda akan diajak menguji pengetahuan umum Anda seputar dunia pengembangan website, mulai dari bahasa pemrograman, teknologi frontend dan backend, hingga konsep penting dalam dunia web.<br />Setiap pertanyaan dirancang untuk menantang sekaligus memberikan wawasan baru, cocok untuk para pemula maupun yang sudah berpengalaman di bidang IT dan pengembangan web.<br />Isi kotak-kotak kosong dengan jawaban yang tepat berdasarkan petunjuk yang diberikan, dan selesaikan semua teka-teki untuk menunjukkan keahlian Anda!<br />Selamat bermain dan semoga sukses!</p>"}